package ru.itmo.lessons.lesson16;

public class Lambda {
    public static void main(String[] args) {
        // TODO:: объявить интерфейс Operation с одним абстрактным методом,
        //  который принимает на вход два числа с плавающей точкой и возвращает число с плавающей точкой

        // TODO:: написать несколько реализаций абстрактного метода

        // Predicate
        // TODO:: написать реализации метода test:
        //  - проверка на положительное число
        //  - проверка на отрицательное число
        //  - проверка на четное число

        // Function
        // TODO:: написать реализации метода apply:
        //  - уменьшение целого числа на 20%
        //  - увеличение числа в два раза
        //  - добавление к положительному числу символов " p."

        // TODO:: написать generic метод, который
        //  принимает Predicate condition и 2 Function: trueFn и falseFn
        //  и возвращает Function, в зависимости от результата предиката
    }
}
